Author: BalaKrishna Chuppala

In [2]:
import numpy as np
import pandas as pd

In [3]:
#Data Cleaning and Preparation

In [4]:
PREVIOUS_MAX_ROWS=pd.options.display.max_rows
pd.options.display.max_rows=10
np.random.seed(12345)

In [7]:
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

In [8]:
#Handling Missing Data

In [9]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [11]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [12]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [13]:
#Filtering Out Missing Data

In [17]:
data = pd.Series([1, np.NaN, 3.5, np.NaN, 7])

In [21]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [22]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [28]:
from numpy import nan as NA
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
[NA, NA, NA], [NA, 6.5, 3.]])
print('Original data \n :',data)
cleaned = data.dropna()

print('Cleanded data : \n',cleaned)

Original data
 :      0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0
Cleanded data :
      0    1    2
0  1.0  6.5  3.0

In [29]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [31]:
data[4] = NA
print('changed data : \n',data)
data.dropna(axis=1, how='all')

changed data :
      0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [32]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
print(df)
df.dropna()
print(df)
df.dropna(thresh=2)

          0         1         2
0 -0.204708       NaN       NaN
1 -0.555730       NaN       NaN
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741
          0         1         2
0 -0.204708       NaN       NaN
1 -0.555730       NaN       NaN
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

          0         1         2
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [33]:
#Filling In Missing Data

In [34]:
df
df.fillna(0)

          0         1         2
0 -0.204708  0.000000  0.000000
1 -0.555730  0.000000  0.000000
2  0.092908  0.000000  0.769023
3  1.246435  0.000000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [36]:
df.fillna({1: 0.5, 2: 1})

          0         1         2
0 -0.204708  0.500000  1.000000
1 -0.555730  0.500000  1.000000
2  0.092908  0.500000  0.769023
3  1.246435  0.500000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [38]:
_ = df.fillna(0, inplace=True)

In [39]:
_

In [40]:
df

          0         1         2
0 -0.204708  0.000000  0.000000
1 -0.555730  0.000000  0.000000
2  0.092908  0.000000  0.769023
3  1.246435  0.000000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [42]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
print(df)
df.fillna(method='ffill')

          0         1         2
0  0.332883 -2.359419 -0.199543
1 -1.541996 -0.970736 -1.307030
2  0.286350       NaN -0.753887
3  0.331286       NaN  0.069877
4  0.246674       NaN       NaN
5  1.327195       NaN       NaN

          0         1         2
0  0.332883 -2.359419 -0.199543
1 -1.541996 -0.970736 -1.307030
2  0.286350 -0.970736 -0.753887
3  0.331286 -0.970736  0.069877
4  0.246674 -0.970736  0.069877
5  1.327195 -0.970736  0.069877

In [43]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.332883 -2.359419 -0.199543
1 -1.541996 -0.970736 -1.307030
2  0.286350 -0.970736 -0.753887
3  0.331286 -0.970736  0.069877
4  0.246674       NaN  0.069877
5  1.327195       NaN  0.069877

In [44]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [45]:
#Removing Duplicates

In [46]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [47]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [48]:
data.drop_duplicates(inplace=True)

In [49]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [51]:
data['v1'] = range(6)

In [52]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [53]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [54]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [55]:
#Transforming Data Using a Lambda Function

In [56]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
'Pastrami', 'corned beef', 'Bacon',
'pastrami', 'honey ham', 'nova lox'],
'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [57]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [58]:
lowercased = data['food'].str.lower()
lowercased
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [59]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [60]:
#Replacing Values inplace of missing values

In [61]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [62]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [63]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [64]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [65]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [66]:
#Renaming Axis Indexes

In [67]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
index=['Ohio', 'Colorado', 'New York'],
columns=['one', 'two', 'three', 'four'])

In [68]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [69]:
data.replace({0:0.1,11:10.5})

          one  two  three  four
Ohio      0.1  1.0    2.0   3.0
Colorado  4.0  5.0    6.0   7.0
New York  8.0  9.0   10.0  10.5

In [70]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [76]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [77]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [80]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [81]:
data.rename(index={'OHIO': 'INDIANA'},
columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [82]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [83]:
# binning or bucketizing for continuous variables

In [84]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [89]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
print(cats)

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [91]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [92]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [93]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [94]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [98]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pop=pd.cut(ages, bins, labels=group_names)

In [99]:
pd.value_counts(pop)

Youth         5
MiddleAged    3
YoungAdult    3
Senior        1
dtype: int64

In [101]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.26, 0.49], (0.72, 0.96], (0.72, 0.96], (0.02, 0.26], (0.02, 0.26], ..., (0.02, 0.26], (0.72, 0.96], (0.26, 0.49], (0.02, 0.26], (0.72, 0.96]]
Length: 20
Categories (4, interval[float64]): [(0.02, 0.26] < (0.26, 0.49] < (0.49, 0.72] < (0.72, 0.96]]

In [106]:
data = np.random.randn(1000) # Normally distributed
cats = pd.qcut(data, 4) # Cut into quartiles
cats
pd.value_counts(cats)

(0.643, 3.526]       250
(-0.0229, 0.643]     250
(-0.692, -0.0229]    250
(-3.647, -0.692]     250
dtype: int64

In [109]:
pd.qcut(data, [0, 0.25, 0.5, 0.75, 1.])

[(-3.647, -0.692], (-0.0229, 0.643], (0.643, 3.526], (0.643, 3.526], (-3.647, -0.692], ..., (0.643, 3.526], (-0.0229, 0.643], (0.643, 3.526], (-3.647, -0.692], (0.643, 3.526]]
Length: 1000
Categories (4, interval[float64]): [(-3.647, -0.692] < (-0.692, -0.0229] < (-0.0229, 0.643] < (0.643, 3.526]]

In [110]:
#filter out the outliers

In [116]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.030545     0.011928    -0.019080    -0.053366
std       1.018887     1.010016     0.971512     0.996158
min      -3.073728    -3.508448    -2.724578    -3.225916
25%      -0.692878    -0.693626    -0.690192    -0.755771
50%       0.065797     0.025870     0.007051    -0.077624
75%       0.733907     0.705384     0.657668     0.613148
max       3.004068     3.113495     3.039873     3.389719

In [123]:
col = data[2]
col[np.abs(col) > 2]

44     2.572055
47    -2.267928
62    -2.125123
77    -2.724578
140   -2.266940
         ...
942    2.110907
947    2.045407
966    2.127938
974   -2.343988
980    2.176474
Name: 2, Length: 39, dtype: float64

In [126]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
76  -3.073728 -1.550583  0.769920 -0.061558
83   1.825574 -0.816806  0.024818 -3.225916
217 -1.565501 -0.004916 -0.256640 -3.142539
482  1.481675  3.113495  0.837764  2.257483
491  3.004068 -0.344172 -0.310593 -1.246154
..        ...       ...       ...       ...
647 -0.888403 -3.089560  0.898763 -0.837477
673  1.492226 -0.655538 -0.718596 -3.066981
688  0.040141  0.360827  3.039873 -0.736824
710 -0.148032 -3.508448 -1.505830  0.006500
871  0.733272  0.623477  0.357085  3.153123

[11 rows x 4 columns]

In [129]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.030615     0.012412    -0.019120    -0.053473
std       1.018653     1.007753     0.971388     0.993072
min      -3.000000    -3.000000    -2.724578    -3.000000
25%      -0.692878    -0.693626    -0.690192    -0.755771
50%       0.065797     0.025870     0.007051    -0.077624
75%       0.733907     0.705384     0.657668     0.613148
max       3.000000     3.000000     3.000000     3.000000

In [131]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0 -1.0
1  1.0  1.0 -1.0  1.0
2 -1.0  1.0  1.0  1.0
3  1.0  1.0  1.0  1.0
4  1.0 -1.0 -1.0 -1.0

In [135]:
#reshaping data

In [134]:
import numpy as np
import pandas as pd
pd.options.display.max_rows = 20
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

In [136]:
data = pd.Series(np.random.randn(9),
index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],[1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1   -0.204708
   2    0.478943
   3   -0.519439
b  1   -0.555730
   3    1.965781
c  1    1.393406
   2    0.092908
d  2    0.281746
   3    0.769023
dtype: float64

In [144]:
pd.Series([0.1,0.2,0.3,0.4,0.5,0.6,0.7,0.8,0.9],index=[['a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],[1, 2, 3,4,5,6,7,8,9]])

a  1    0.1
   2    0.2
b  3    0.3
   4    0.4
   5    0.5
c  6    0.6
   7    0.7
d  8    0.8
   9    0.9
dtype: float64

In [145]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [146]:
data

a  1   -0.204708
   2    0.478943
   3   -0.519439
b  1   -0.555730
   3    1.965781
c  1    1.393406
   2    0.092908
d  2    0.281746
   3    0.769023
dtype: float64

In [148]:
data['b']

1   -0.555730
3    1.965781
dtype: float64

In [149]:
data['b':'c']

b  1   -0.555730
   3    1.965781
c  1    1.393406
   2    0.092908
dtype: float64

In [150]:
data.loc[['b', 'd']]

b  1   -0.555730
   3    1.965781
d  2    0.281746
   3    0.769023
dtype: float64

In [152]:
data.loc[:]

a  1   -0.204708
   2    0.478943
   3   -0.519439
b  1   -0.555730
   3    1.965781
c  1    1.393406
   2    0.092908
d  2    0.281746
   3    0.769023
dtype: float64

In [153]:
data.loc[:,2]

a    0.478943
c    0.092908
d    0.281746
dtype: float64

In [154]:
data.unstack()

          1         2         3
a -0.204708  0.478943 -0.519439
b -0.555730       NaN  1.965781
c  1.393406  0.092908       NaN
d       NaN  0.281746  0.769023

In [155]:
data.unstack().stack()

a  1   -0.204708
   2    0.478943
   3   -0.519439
b  1   -0.555730
   3    1.965781
c  1    1.393406
   2    0.092908
d  2    0.281746
   3    0.769023
dtype: float64

In [157]:
frame = pd.DataFrame(
    np.arange(12).reshape((4, 3)),
index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [160]:
type(frame)

pandas.core.frame.DataFrame

In [161]:
type(frame.index)

pandas.core.indexes.multi.MultiIndex

In [162]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [163]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [164]:
frame['Colorado']

color      Green
key1 key2
a    1         2
     2         5
b    1         8
     2        11

In [165]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [166]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [167]:
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11